In [59]:
import pandas as pd

In [60]:
primary= pd.read_csv('code/primary.csv', skiprows=1)
secondary=pd.read_csv('code/secondary.csv',skiprows=1)
tertiary=pd.read_csv('code/tertiary.csv',skiprows=1)

In [61]:
primary.head(5)

  Unnamed: 0    2014    2015    2016    2017    2018    2019    2020
0  Australia   9 258   9 527  10 020  10 157  10 760  11 362  12 673
1    Austria  11 111  11 692  12 495  12 677  13 128  13 684  14 029
2    Belgium  10 091  10 183  10 764  10 994  11 461  12 041  12 813
3   Bulgaria   2 982   2 862   3 174   3 373   3 831   4 557   5 211
4     Canada   9 202   9 156   9 649  10 174  10 555  10 674  11 533

In [62]:
secondary.head(5)

  Unnamed: 0    2014    2015    2016    2017    2018    2019    2020
0  Australia  11 733  12 279  11 659  12 540  14 181  14 146  15 437
1    Austria  15 035  15 482  16 574  16 605  16 718  17 371  17 478
2    Belgium  13 012  13 169  13 774  14 453  14 732  15 491  16 576
3   Bulgaria   3 483   3 422   3 741   4 113   4 654   5 513   6 232
4     Canada  12 705  13 559  14 521  13 804  14 474  14 708  14 520

In [63]:
# Assuming you have three DataFrames named primary, secondary, and tertiary
countries_primary = set(primary['Unnamed: 0'])
countries_secondary = set(secondary['Unnamed: 0'])
countries_tertiary = set(tertiary['Unnamed: 0'])

common_countries = countries_primary.intersection(countries_secondary, countries_tertiary)

print("Common countries in all three DataFrames:")
print(common_countries)

Common countries in all three DataFrames:
{'Iceland', 'United States', 'Greece', 'Romania', 'New Zealand', 'Spain', 'Bulgaria', 'Finland', 'Lithuania', 'Luxembourg', 'OECD - Average', 'Mexico', 'Netherlands', 'Austria', 'Czechia', 'Israel', 'Canada', 'Croatia', 'Ireland', 'TÃ¼rkiye', 'Belgium', 'Hungary', 'Denmark', 'Australia', 'Latvia', 'Portugal', 'Slovenia', 'Colombia', 'Estonia', 'Sweden', 'Korea', 'Chile', 'Japan', 'Slovak Republic', 'Germany', 'France', 'Norway', 'United Kingdom', 'Italy', 'Poland'}

In [64]:
common_countries = ['Iceland', 'United States', 'Greece', 'Romania', 'New Zealand', 'Spain', 'Bulgaria',
                    'Finland', 'Lithuania', 'Luxembourg', 'Mexico', 'Netherlands', 'Austria', 'Czechia',
                    'Israel', 'Canada', 'Ireland', 'Belgium', 'Hungary', 'Denmark', 'Australia', 'Latvia',
                    'Portugal', 'Slovenia', 'Estonia', 'Sweden', 'Korea', 'Chile', 'Japan', 'Slovak Republic',
                    'Germany', 'France', 'Norway', 'United Kingdom', 'Italy', 'Poland']

# Subset each DataFrame with the common countries
primary = primary[primary['Unnamed: 0'].isin(common_countries)]
secondary = secondary[secondary['Unnamed: 0'].isin(common_countries)]
tertiary = tertiary[tertiary['Unnamed: 0'].isin(common_countries)]

In [65]:
primary = primary.rename(columns={'Unnamed: 0': 'country_name', '2017': 'year1', '2019':'year2'})

primary.isna().sum()

country_name    0
2014            1
2015            1
2016            0
year1           0
2018            0
year2           0
2020            1
dtype: int64

In [66]:
secondary = secondary.rename(columns={'Unnamed: 0': 'country_name', '2017': 'year1', '2019':'year2'})

secondary.isna().sum()

country_name    0
2014            2
2015            1
2016            0
year1           0
2018            0
year2           0
2020            1
dtype: int64

In [67]:
tertiary = tertiary.rename(columns={'Unnamed: 0': 'country_name', '2017': 'year1', '2019':'year2'})

tertiary.isna().sum()

country_name    0
2014            1
2015            1
2016            1
year1           0
2018            0
year2           0
2020            1
dtype: int64

In [68]:
primary = primary[['country_name', 'year1', 'year2']]
secondary = secondary[['country_name', 'year1', 'year2']]
tertiary = tertiary[['country_name', 'year1', 'year2']]

In [69]:
primary['year1'] = primary['year1'].apply(lambda x: x.replace(" ", ""))
primary['year2'] = primary['year2'].apply(lambda x: x.replace(" ", ""))
primary.head(10)

   country_name  year1  year2
0     Australia  10157  11362
1       Austria  12677  13684
2       Belgium  10994  12041
3      Bulgaria   3373   4557
4        Canada  10174  10674
5         Chile   5948   6114
8       Czechia   5948   7758
9       Denmark  12479  13593
10      Estonia   7329   9660
11      Finland   9631  10888

In [70]:
primary.to_csv('code/primary_updated.csv', index=False)

In [71]:
secondary['year1'] = secondary['year1'].apply(lambda x: x.replace(" ", ""))
secondary['year2'] = secondary['year2'].apply(lambda x: x.replace(" ", ""))
secondary.head(10)
secondary.to_csv('code/secondary_updated.csv', index=False)

In [72]:
tertiary['year1'] = tertiary['year1'].apply(lambda x: x.replace(" ", ""))
tertiary['year2'] = tertiary['year2'].apply(lambda x: x.replace(" ", ""))
tertiary.head(10)
tertiary.to_csv('code/tertiary_updated.csv', index=False)